## Terraform Plan Output - sim - azuremonitor
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.AzureMonitor.azurerm_resource_group.this will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_resource_group" "this" {
      - id       = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-azmonitor-eastus-rg" -> null
      - location = "eastus" -> null
      - name     = "dbdemo-sim-azmonitor-eastus-rg" -> null
      - tags     = {
          - "environment" = "sim"
          - "owner"       = "av"
          - "role"        = "diagnostics"
          - "source"      = "terraform"
          - "stack"       = "azuremonitor"
        } -> null
    }

  # module.AzureMonitor.azurerm_resource_group.this["eastus"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "dbdemo-sim-azmon-eastus-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "diagnostics"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
    }

  # module.AzureMonitor.azurerm_resource_group.this["eastus2"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "dbdemo-sim-azmon-eastus2-rg"
      + tags     = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "diagnostics"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
    }

  # module.AzureMonitor.module.AzureMonitor.azurerm_eventhub.eh[0] will be destroyed
  # (because module.AzureMonitor.module.AzureMonitor is not in configuration)
  - resource "azurerm_eventhub" "eh" {
      - id                  = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-azmonitor-eastus-rg/providers/Microsoft.EventHub/namespaces/dbdemo-sim-azmonitor-eastus-ehn/eventhubs/dbdemo-sim-azmonitor-eastus-evh" -> null
      - message_retention   = 1 -> null
      - name                = "dbdemo-sim-azmonitor-eastus-evh" -> null
      - namespace_name      = "dbdemo-sim-azmonitor-eastus-ehn" -> null
      - partition_count     = 4 -> null
      - partition_ids       = [
          - "0",
          - "1",
          - "2",
          - "3",
        ] -> null
      - resource_group_name = "dbdemo-sim-azmonitor-eastus-rg" -> null
      - status              = "Active" -> null
    }

  # module.AzureMonitor.module.AzureMonitor.azurerm_eventhub_namespace.ehnamespace[0] will be destroyed
  # (because module.AzureMonitor.module.AzureMonitor is not in configuration)
  - resource "azurerm_eventhub_namespace" "ehnamespace" {
      - auto_inflate_enabled                = false -> null
      - capacity                            = 2 -> null
      - default_primary_connection_string   = (sensitive value) -> null
      - default_primary_key                 = (sensitive value) -> null
      - default_secondary_connection_string = (sensitive value) -> null
      - default_secondary_key               = (sensitive value) -> null
      - id                                  = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-azmonitor-eastus-rg/providers/Microsoft.EventHub/namespaces/dbdemo-sim-azmonitor-eastus-ehn" -> null
      - local_authentication_enabled        = true -> null
      - location                            = "eastus" -> null
      - maximum_throughput_units            = 0 -> null
      - minimum_tls_version                 = "1.2" -> null
      - name                                = "dbdemo-sim-azmonitor-eastus-ehn" -> null
      - network_rulesets                    = [
          - {
              - default_action                 = "Allow"
              - ip_rule                        = []
              - public_network_access_enabled  = true
              - trusted_service_access_enabled = false
              - virtual_network_rule           = []
            },
        ] -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "dbdemo-sim-azmonitor-eastus-rg" -> null
      - sku                                 = "Basic" -> null
      - tags                                = {
          - "environment" = "sim"
          - "owner"       = "av"
          - "role"        = "diagnostics"
          - "source"      = "terraform"
          - "stack"       = "azuremonitor"
        } -> null
      - zone_redundant                      = false -> null
    }

  # module.AzureMonitor.module.AzureMonitor.azurerm_log_analytics_workspace.law will be destroyed
  # (because module.AzureMonitor.module.AzureMonitor is not in configuration)
  - resource "azurerm_log_analytics_workspace" "law" {
      - allow_resource_only_permissions = true -> null
      - cmk_for_query_forced            = false -> null
      - daily_quota_gb                  = -1 -> null
      - id                              = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-azmonitor-eastus-rg/providers/Microsoft.OperationalInsights/workspaces/dbdemo-sim-azmonitor-eastus-log" -> null
      - internet_ingestion_enabled      = true -> null
      - internet_query_enabled          = true -> null
      - local_authentication_disabled   = false -> null
      - location                        = "eastus" -> null
      - name                            = "dbdemo-sim-azmonitor-eastus-log" -> null
      - primary_shared_key              = (sensitive value) -> null
      - resource_group_name             = "dbdemo-sim-azmonitor-eastus-rg" -> null
      - retention_in_days               = 30 -> null
      - secondary_shared_key            = (sensitive value) -> null
      - sku                             = "PerGB2018" -> null
      - tags                            = {
          - "environment" = "sim"
          - "owner"       = "av"
          - "role"        = "diagnostics"
          - "source"      = "terraform"
          - "stack"       = "azuremonitor"
        } -> null
      - workspace_id                    = "3d2ab07d-fe71-42e7-9620-66d0b33741d4" -> null
    }

  # module.AzureMonitor.module.AzureMonitor.azurerm_storage_account.sa[0] will be destroyed
  # (because module.AzureMonitor.module.AzureMonitor is not in configuration)
  - resource "azurerm_storage_account" "sa" {
      - access_tier                       = "Cool" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "LRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = true -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-sim-azmonitor-eastus-rg/providers/Microsoft.Storage/storageAccounts/dbdemosimazmonitoreastus" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - location                          = "eastus" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "dbdemosimazmonitoreastus" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_blob_connection_string    = (sensitive value) -> null
      - primary_blob_endpoint             = "https://dbdemosimazmonitoreastus.blob.core.windows.net/" -> null
      - primary_blob_host                 = "dbdemosimazmonitoreastus.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_dfs_endpoint              = "https://dbdemosimazmonitoreastus.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "dbdemosimazmonitoreastus.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://dbdemosimazmonitoreastus.file.core.windows.net/" -> null
      - primary_file_host                 = "dbdemosimazmonitoreastus.file.core.windows.net" -> null
      - primary_location                  = "eastus" -> null
      - primary_queue_endpoint            = "https://dbdemosimazmonitoreastus.queue.core.windows.net/" -> null
      - primary_queue_host                = "dbdemosimazmonitoreastus.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://dbdemosimazmonitoreastus.table.core.windows.net/" -> null
      - primary_table_host                = "dbdemosimazmonitoreastus.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://dbdemosimazmonitoreastus.z13.web.core.windows.net/" -> null
      - primary_web_host                  = "dbdemosimazmonitoreastus.z13.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "dbdemo-sim-azmonitor-eastus-rg" -> null
      - secondary_access_key              = (sensitive value) -> null
      - secondary_connection_string       = (sensitive value) -> null
      - sftp_enabled                      = false -> null
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "environment" = "sim"
          - "owner"       = "av"
          - "role"        = "diagnostics"
          - "source"      = "terraform"
          - "stack"       = "azuremonitor"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.AzureMonitor.module.AzureMonitor.random_integer.rng will be destroyed
  # (because module.AzureMonitor.module.AzureMonitor is not in configuration)
  - resource "random_integer" "rng" {
      - id     = "996" -> null
      - max    = 999 -> null
      - min    = 0 -> null
      - result = 996 -> null
    }

  # module.AzureMonitor.module.AzureMonitor["eastus"].azurerm_eventhub.eh[0] will be created
  + resource "azurerm_eventhub" "eh" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "dbdemo-sim-azmon-eastus-evh"
      + namespace_name      = "dbdemo-sim-azmon-eastus-ehn"
      + partition_count     = 4
      + partition_ids       = (known after apply)
      + resource_group_name = "dbdemo-sim-azmon-eastus-rg"
      + status              = "Active"
    }

  # module.AzureMonitor.module.AzureMonitor["eastus"].azurerm_eventhub_namespace.ehnamespace[0] will be created
  + resource "azurerm_eventhub_namespace" "ehnamespace" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 2
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "eastus"
      + maximum_throughput_units                  = (known after apply)
      + minimum_tls_version                       = (known after apply)
      + name                                      = "dbdemo-sim-azmon-eastus-ehn"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "dbdemo-sim-azmon-eastus-rg"
      + sku                                       = "Basic"
      + tags                                      = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "diagnostics"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
      + zone_redundant                            = false
    }

  # module.AzureMonitor.module.AzureMonitor["eastus"].azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "dbdemo-sim-azmon-eastus-log"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dbdemo-sim-azmon-eastus-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "diagnostics"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
      + workspace_id                    = (known after apply)
    }

  # module.AzureMonitor.module.AzureMonitor["eastus"].azurerm_storage_account.sa[0] will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = "Cool"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "dbdemo-sim-azmon-eastus-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "diagnostics"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
    }

  # module.AzureMonitor.module.AzureMonitor["eastus"].random_integer.rng will be created
  + resource "random_integer" "rng" {
      + id     = (known after apply)
      + max    = 999
      + min    = 0
      + result = (known after apply)
    }

  # module.AzureMonitor.module.AzureMonitor["eastus2"].azurerm_eventhub.eh[0] will be created
  + resource "azurerm_eventhub" "eh" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "dbdemo-sim-azmon-eastus2-evh"
      + namespace_name      = "dbdemo-sim-azmon-eastus2-ehn"
      + partition_count     = 4
      + partition_ids       = (known after apply)
      + resource_group_name = "dbdemo-sim-azmon-eastus2-rg"
      + status              = "Active"
    }

  # module.AzureMonitor.module.AzureMonitor["eastus2"].azurerm_eventhub_namespace.ehnamespace[0] will be created
  + resource "azurerm_eventhub_namespace" "ehnamespace" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 2
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "eastus2"
      + maximum_throughput_units                  = (known after apply)
      + minimum_tls_version                       = (known after apply)
      + name                                      = "dbdemo-sim-azmon-eastus2-ehn"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "dbdemo-sim-azmon-eastus2-rg"
      + sku                                       = "Basic"
      + tags                                      = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "diagnostics"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
      + zone_redundant                            = false
    }

  # module.AzureMonitor.module.AzureMonitor["eastus2"].azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus2"
      + name                            = "dbdemo-sim-azmon-eastus2-log"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dbdemo-sim-azmon-eastus2-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "diagnostics"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
      + workspace_id                    = (known after apply)
    }

  # module.AzureMonitor.module.AzureMonitor["eastus2"].azurerm_storage_account.sa[0] will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = "Cool"
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "eastus2"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "dbdemo-sim-azmon-eastus2-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "environment" = "sim"
          + "owner"       = "av"
          + "role"        = "diagnostics"
          + "source"      = "terraform"
          + "stack"       = "azuremonitor"
        }
    }

  # module.AzureMonitor.module.AzureMonitor["eastus2"].random_integer.rng will be created
  + resource "random_integer" "rng" {
      + id     = (known after apply)
      + max    = 999
      + min    = 0
      + result = (known after apply)
    }

  # module.AzureMonitor.module.naming.random_string.first_letter will be destroyed
  # (because module.AzureMonitor.module.naming is not in configuration)
  - resource "random_string" "first_letter" {
      - id          = "c" -> null
      - length      = 1 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = false -> null
      - numeric     = false -> null
      - result      = "c" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.AzureMonitor.module.naming.random_string.main will be destroyed
  # (because module.AzureMonitor.module.naming is not in configuration)
  - resource "random_string" "main" {
      - id          = "mbwpodv0lkw4ttq8pmua6cbs4nsruylsxa47pfklstibjl2grpq986efb5bv" -> null
      - length      = 60 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "mbwpodv0lkw4ttq8pmua6cbs4nsruylsxa47pfklstibjl2grpq986efb5bv" -> null
      - special     = false -> null
      - upper       = false -> null
    }

  # module.AzureMonitor.module.naming["eastus"].random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.AzureMonitor.module.naming["eastus"].random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.AzureMonitor.module.naming["eastus2"].random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.AzureMonitor.module.naming["eastus2"].random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 16 to add, 0 to change, 8 to destroy.
```
</details>